{
  "token2idx": {
    "[PAD]": 0,
    "[BOS]": 1,
    "[EOS]": 2,
    "[UNK]": 3,
    "[#Branch1]": 4,
    "[#Branch2]": 5,
    "[#C-1]": 6,
    "[#C]": 7,
    "[#N+1]": 8,
    "[#N]": 9,
    "[-/Ring1]": 10,
    "[-/Ring2]": 11,
    "[-\\Ring1]": 12,
    "[/Br]": 13,
    "[/C@@H1]": 14,
    "[/C@@]": 15,
    "[/C@H1]": 16,
    "[/C@]": 17,
    "[/C]": 18,
    "[/Cl]": 19,
    "[/F]": 20,
    "[/I]": 21,
    "[/N+1]": 22,
    "[/NH1]": 23,
    "[/N]": 24,
    "[/O-1]": 25,
    "[/O]": 26,
    "[/P]": 27,
    "[/S@@]": 28,
    "[/S@]": 29,
    "[/S]": 30,
    "[125I]": 31,
    "[18F]": 32,
    "[2H]": 33,
    "[3H]": 34,
    "[=Branch1]": 35,
    "[=Branch2]": 36,
    "[=C]": 37,
    "[=N+1]": 38,
    "[=N-1]": 39,
    "[=N]": 40,
    "[=O]": 41,
    "[=P+1]": 42,
    "[=PH1]": 43,
    "[=PH2]": 44,
    "[=PH3]": 45,
    "[=P]": 46,
    "[=Ring1]": 47,
    "[=Ring2]": 48,
    "[=S@@]": 49,
    "[=S@]": 50,
    "[=SH1]": 51,
    "[=S]": 52,
    "[Br]": 53,
    "[Branch1]": 54,
    "[Branch2]": 55,
    "[C+1]": 56,
    "[C-1]": 57,
    "[C@@H1]": 58,
    "[C@@]": 59,
    "[C@H1]": 60,
    "[C@]": 61,
    "[CH1-1]": 62,
    "[C]": 63,
    "[Cl]": 64,
    "[F]": 65,
    "[I]": 66,
    "[N+1]": 67,
    "[N-1]": 68,
    "[N@+1]": 69,
    "[N@@+1]": 70,
    "[N@@]": 71,
    "[N@]": 72,
    "[NH1+1]": 73,
    "[NH1]": 74,
    "[NH2+1]": 75,
    "[NH3+1]": 76,
    "[N]": 77,
    "[O-1]": 78,
    "[O]": 79,
    "[P+1]": 80,
    "[P@@]": 81,
    "[P@]": 82,
    "[PH1]": 83,
    "[PH2]": 84,
    "[P]": 85,
    "[Ring1]": 86,
    "[Ring2]": 87,
    "[S+1]": 88,
    "[S-1]": 89,
    "[S@@]": 90,
    "[S@]": 91,
    "[SH1]": 92,
    "[S]": 93,
    "[\\Br]": 94,
    "[\\C@@H1]": 95,
    "[\\C@@]": 96,
    "[\\C@H1]": 97,
    "[\\C]": 98,
    "[\\Cl]": 99,
    "[\\F]": 100,
    "[\\I]": 101,
    "[\\N+1]": 102,
    "[\\NH1]": 103,
    "[\\N]": 104,
    "[\\O-1]": 105,
    "[\\O]": 106,
    "[\\P]": 107,
    "[\\S@@]": 108,
    "[\\S@]": 109,
    "[\\S]": 110
  },
  "idx2token": {
    "0": "[PAD]",
    "1": "[BOS]",
    "2": "[EOS]",
    "3": "[UNK]",
    "4": "[#Branch1]",
    "5": "[#Branch2]",
    "6": "[#C-1]",
    "7": "[#C]",
    "8": "[#N+1]",
    "9": "[#N]",
    "10": "[-/Ring1]",
    "11": "[-/Ring2]",
    "12": "[-\\Ring1]",
    "13": "[/Br]",
    "14": "[/C@@H1]",
    "15": "[/C@@]",
    "16": "[/C@H1]",
    "17": "[/C@]",
    "18": "[/C]",
    "19": "[/Cl]",
    "20": "[/F]",
    "21": "[/I]",
    "22": "[/N+1]",
    "23": "[/NH1]",
    "24": "[/N]",
    "25": "[/O-1]",
    "26": "[/O]",
    "27": "[/P]",
    "28": "[/S@@]",
    "29": "[/S@]",
    "30": "[/S]",
    "31": "[125I]",
    "32": "[18F]",
    "33": "[2H]",
    "34": "[3H]",
    "35": "[=Branch1]",
    "36": "[=Branch2]",
    "37": "[=C]",
    "38": "[=N+1]",
    "39": "[=N-1]",
    "40": "[=N]",
    "41": "[=O]",
    "42": "[=P+1]",
    "43": "[=PH1]",
    "44": "[=PH2]",
    "45": "[=PH3]",
    "46": "[=P]",
    "47": "[=Ring1]",
    "48": "[=Ring2]",
    "49": "[=S@@]",
    "50": "[=S@]",
    "51": "[=SH1]",
    "52": "[=S]",
    "53": "[Br]",
    "54": "[Branch1]",
    "55": "[Branch2]",
    "56": "[C+1]",
    "57": "[C-1]",
    "58": "[C@@H1]",
    "59": "[C@@]",
    "60": "[C@H1]",
    "61": "[C@]",
    "62": "[CH1-1]",
    "63": "[C]",
    "64": "[Cl]",
    "65": "[F]",
    "66": "[I]",
    "67": "[N+1]",
    "68": "[N-1]",
    "69": "[N@+1]",
    "70": "[N@@+1]",
    "71": "[N@@]",
    "72": "[N@]",
    "73": "[NH1+1]",
    "74": "[NH1]",
    "75": "[NH2+1]",
    "76": "[NH3+1]",
    "77": "[N]",
    "78": "[O-1]",
    "79": "[O]",
    "80": "[P+1]",
    "81": "[P@@]",
    "82": "[P@]",
    "83": "[PH1]",
    "84": "[PH2]",
    "85": "[P]",
    "86": "[Ring1]",
    "87": "[Ring2]",
    "88": "[S+1]",
    "89": "[S-1]",
    "90": "[S@@]",
    "91": "[S@]",
    "92": "[SH1]",
    "93": "[S]",
    "94": "[\\Br]",
    "95": "[\\C@@H1]",
    "96": "[\\C@@]",
    "97": "[\\C@H1]",
    "98": "[\\C]",
    "99": "[\\Cl]",
    "100": "[\\F]",
    "101": "[\\I]",
    "102": "[\\N+1]",
    "103": "[\\NH1]",
    "104": "[\\N]",
    "105": "[\\O-1]",
    "106": "[\\O]",
    "107": "[\\P]",
    "108": "[\\S@@]",
    "109": "[\\S@]",
    "110": "[\\S]"
  }
}